com/p6/p6-2.tex
% Created 2021-11-01 lun 22:39
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{fullpage}
\date{}
\title{práctica N2}
\hypersetup{
 pdfauthor={},
 pdftitle={práctica N2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section*{2.}
\label{sec:org39eb6b0}
\subsection*{direcciones}
\label{sec:org9d59948}
\begin{verbatim}
r1-1		200.13.147.33
a		200.13.147.34
b		200.13.147.35
c		200.13.147.36
mx.acme.ar	200.13.147.59
ns1.acme.ar	200.13.147.60

r1-2		200.13.147.65
d		200.13.147.66
e		200.13.147.67
ns2.cs.acme.ar	200.13.147.90

r1-3		200.13.147.97
f		200.13.147.98
g		200.13.147.99
mx.cs.acme.ar	200.13.147.113
\end{verbatim}
\subsection*{named.conf}
\label{sec:org3e00842}
\subsubsection*{named.ns1.conf}
\label{sec:orgc46b736}
\begin{verbatim}
options{
directory "/var/cache/bind";
notify yes;
allow-transfer {none;};
};

zone "acme.ar"{
type master;
file "/etc/bind/db.acme.ar";
allow-query {any;};
allow-transfer {200.13.147.90;};
};

zone "cs.acme.ar"{
type master;
file "/etc/bind/db.cs.acme.ar";
allow-query {any;};
allow-transfer {200.13.147.90;};
};

zone "147.13.200.in-addr.arpa."{
type master;
file "/etc/bind/rev.192";
allow-transfer {localnets;};
};
\end{verbatim}
\subsubsection*{named.ns2.conf:}
\label{sec:org850dec4}
\begin{verbatim}
options{
	directory "/var/cache/bind";
}

zone "acme.ar"{
     type slave;
     file "db.acme.ar";
     allow-query {any;};
     allow-transfer {none;};
}

zone "cs.acme.ar"{
     type slave;
     file "db.cs.acme.ar";
     allow-query {any;};
     allow-transfer {none;};
}
\end{verbatim}
\subsubsection*{db.acme.ar}
\label{sec:org88c47fe}
\begin{verbatim}
$TTL	7200
@	SOA	ns1	hostmaster.acme.ar.(
2021110100	;serial
1d		;refresh
1h		;retry
1w		;expire
2h0		;neg.ttl
)
IN	NS	ns1
IN	NS	ns2.cs
MX	10 mx
MX	20 mx.cs

cs    NS	ns2.cs.acme.ar.
NS	ns1

ns2.cs.acme.ar.	A	200.13.147.90
r1-1		A	200.13.147.33
r1			CNAME	r1-1
a		A	200.13.147.34
b		A	200.13.147.35
c		A	200.13.147.36
mx.acme.ar.	A	200.13.147.59
ns1.acme.ar.	A	200.13.147.60
r1-2		A	200.13.147.65
d		A	200.13.147.66
e		A	200.13.147.67
r1-3		A	200.13.147.97
f		A	200.13.147.98
g		A	200.13.147.99
\end{verbatim}
\subsubsection*{db.cs.acme.ar}
\label{sec:org53025d3}
\begin{verbatim}
$TTL	7200
      @	SOA	ns1.acme.ar	hostmaster.acme.ar(
      2021110100	;serial
      1d		;refresh
      1h		;retry
      1w		;expire
      2h0		;neg.ttl
      )
  IN		NS	ns1.acme.ar.
  IN		NS	ns2

mx		A	200.13.147.113
ns2		A	200.13.147.90
\end{verbatim}
\end{document}